src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope"
					xmlns:us="http://soap-example.org/soap-example">
	<soapenv:Header/>
	<soapenv:Body>
		<us:getUserRequest>
			<us:name>Jayanth</us:name>
		</us:getUserRequest>
	</soapenv:Body>
</soapenv:Envelope>